import os


# 检测名称，观察是否可以直接进行分类
def name_check(file_name):
    if file_name.find("可回收") != -1:
        return 1
    if file_name.find("有害垃圾") != -1:
        return 2
    if file_name.find("厨余") != -1:
        return 3
    if file_name.find("其他") != -1:
        return 4
    return 0


class ConvClassifier:
    def __init__(self):
        self.recycle = ['传单', '充电宝', '包', '塑料玩具', '塑料碗盆', '塑料衣架', '快递纸袋', '报纸', '插头电线', '旧书', '旧衣服', '易拉罐', '杂志', '枕头',
                        '毛绒玩具', '泡沫塑料', '洗发水瓶', '牛奶盒等利乐包装', '玻璃', '玻璃瓶罐', '皮鞋', '砧板', '纸板箱', '调料瓶', '酒瓶', '金属食品罐', '锅',
                        '食用油桶', '饮料瓶', '垃圾桶', '塑料器皿', '纸盒纸箱', '金属厨具', '鞋', '玻璃器皿', '金属器皿', '书籍纸张', '不锈钢制品', '体重秤',
                        '保温杯', '单车', '卡', '吹风机', '帽子', '手机', '手电筒', '手表', '打印机', '拉杆箱', '拖鞋', '木质梳子', '灭火器', '烟灰缸',
                        '热水瓶', '燃气瓶', '电视机', '电路板', '电风扇', '纸牌', '耳机', '计算器', '话筒', '路由器', '轮胎', '钥匙', '铁丝球', '锅盖',
                        '键盘', '闹铃', '雨伞', '鼠标', '台历', '椅子', '烤箱', '金属碗']
        self.kitchen = ['剩菜剩饭', '大骨头', '果壳瓜皮', '残枝落叶', '水果果皮', '水果果肉', '茶叶渣', '菜梗菜叶', '落叶', '蛋壳', '西餐糕点', '鱼骨', '剩饭剩菜',
                        '果皮果肉', '菜帮菜叶', '咖啡', '圣女果', '地瓜', '坚果', '壳', '巧克力', '果冻', '核桃', '梨', '橙子', '水果', '泡菜', '火龙果',
                        '烤鸡', '瓜子', '甘蔗', '番茄', '秸秆杯', '秸秆碗', '粉条', '苹果', '茶叶', '草莓', '薯条', '薯片', '蘑菇', '蛋挞', '豆腐',
                        '鸡翅', '白萝卜', '红肠', '胡萝卜', '花生皮']
        self.harmful = ['干电池', '废弃水银温度计', '废旧灯管灯泡', '杀虫剂容器', '电池', '软膏', '过期药物', '除草剂容器', '洗护用品', '电池板', '纽扣电池', '胶水',
                        '蓄电池']
        self.etc = ['一次性餐具', '化妆品瓶', '卫生纸', '尿片', '污损塑料', '烟蒂', '牙签', '破碎花盆及碟碗', '竹筷', '纸杯', '贝壳', '筷子', '陶瓷器皿',
                    '一次性快餐盒', '污损用纸','串串竹签', '便利贴', '口罩', '干燥剂', '涂改带', '湿纸巾', '牙刷', '眼镜', '苍蝇拍']

    def classify(self, class_name):
        # 如果名称带有分类信息，则直接分类
        flag = name_check(class_name)
        if flag != 0:
            return flag
        # 否则在现有分类信息中查找
        for item in self.recycle:
            if item == class_name:
                return 1

        for item in self.harmful:
            if item == class_name:
                return 2

        for item in self.kitchen:
            if item == class_name:
                return 3
        # 如果现有分类信息当中没有，则返回为其他垃圾
        return 4

    def name_process(self, file_name):
        if file_name.find('_') == -1:
            return file_name
        res_set = file_name.split('_')
        if file_name.find("_") == 4:
            res = res_set[1]
        else:
            res = res_set[0]
        return res
